In [3]:
person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}

In [4]:
people = {
    "first": ["Corey"], 
    "last": ["Schafer"], 
    "email": ["CoreyMSchafer@gmail.com"]
}

In [5]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [6]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame(people)

In [9]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [10]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [11]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [12]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [13]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [14]:
df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [15]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [16]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [17]:
df['last']=='Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [18]:
filt = (df['last']=='Doe')

In [19]:
df[filt]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [20]:
df.loc[filt]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [21]:
df.loc[filt,'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [22]:
filt = ((df['last']=='Doe') & (df['first']=='John'))

In [23]:
df.loc[filt,'email']

2    JohnDoe@email.com
Name: email, dtype: object

In [24]:
filt = ((df['last']=='Schafer') | (df['first']=='John'))

In [25]:
df.loc[filt,'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [26]:
df.loc[~filt,'email']

1    JaneDoe@email.com
Name: email, dtype: object

In [27]:
# Part5

In [28]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [29]:
import pandas as pd

In [30]:
df = pd.DataFrame(people)

In [31]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [32]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [33]:
df.columns = ['first_name','last_name','email']

In [34]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [35]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [36]:
df.columns = [x.upper() for x in df.columns]

In [37]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [38]:
# df.columns = df.columns.str.replace(' ','_')

In [40]:
df.columns = [x.lower() for x in df.columns]

In [41]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [43]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)

In [44]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [45]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [46]:
df.iloc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [47]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']

In [48]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [49]:
df.loc[2,['last','email']]

last                   Smith
email    JohnSmith@email.com
Name: 2, dtype: object

In [50]:
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [51]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [53]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last']
# df[filt,'last']='Smith'   # Update the column

2    Doe
Name: last, dtype: object

In [54]:
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [55]:
df['email'] = df['email'].str.lower()  # for change permanent value

In [56]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [57]:
'''
apply
mao
applymap
replace
'''

'\napply\nmao\napplymap\nreplace\n'

In [59]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64